# Allows to install updates automatically.
tap 'domt4/autoupdate'

# GNU utilities.
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'make'
brew 'rsync'
brew 'tree'
brew 'unzip'
brew 'watch'
brew 'curl'

# QuickLook plugins, https://github.com/sindresorhus/quick-look-plugins
# cask 'betterzip'
# cask 'qlcolorcode'
# cask 'qlimagesize'
# cask 'qlmarkdown'
# cask 'qlprettypatch'
# cask 'qlstephen'
# cask 'qlvideo'
# cask 'quicklook-json'
# cask 'quicklookase'
# cask 'suspicious-package'
# cask 'webpquicklook'

# FUSE.
cask 'macfuse'
#brew 'sshfs'

# Apps without topic directories.
# brew 'httpie'
# brew 'imagemagick'
brew 'jid'
# brew 'm-cli'
# brew 'ncdu'
brew 'nmap'
brew 'p7zip'
brew 'shellcheck'
brew 'speedtest_cli'
# brew 'testssl'
brew 'wakeonlan'
# brew 'webkit2png'
# brew 'xz'

# Useful Tools
# cask 'macdown'
cask 'flycut'
cask 'keka'

# Browser
cask 'google-chrome'
cask 'opera'
cask 'firefox'

# vim: set ft=ruby ts=2 sw=2 et:
